In [ ]:
'''
    ipynb file that includes all python scripts/modules created for this project.
    This file helps to set up connection to database, populate database from CSV files, make queries such as
    select data of certain types/conditions, insert and remove records.
    @file csc_336_project.ipynb
    @author Junhui Huang, Yenny Huang
    @version 1.02 May, 2023
'''

In [21]:
# Importing modules
import mysql.connector
import numpy as np
import pandas as pd
from datetime import date

In [22]:
# Read authentication file
auth = np.loadtxt('auth.txt', dtype=str)
auth

array(['username', 'P@33W0rd', '127.0.0.1', 'bodega'], dtype='<U9')

In [23]:
# Config dictionary
labels = ['username', 'password', 'host', 'database']
config = dict(zip(labels, list(auth)))
config

{'username': 'username',
 'password': 'P@33W0rd',
 'host': '127.0.0.1',
 'database': 'bodega'}

In [24]:
# Reading the CSV into a pandas dataframe
products = pd.read_csv('products.csv', header=None)
products.columns = ['product_id', 'product_name']
products.head(10)

   product_id                 product_name
0           1                    Coca-Cola
1           2         Doritos Nacho Cheese
2           3                      Kit Kat
3           4                     Red Bull
4           5            Pringles Original
5           6  Reese\'s Peanut Butter Cups
6           7                M&M\'s Peanut
7           8               Lay\'s Classic
8           9            Snapple Peach Tea
9          10              Tostitos Scoops

In [25]:
# Set up connection
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

# Inserting products
for i in range(len(products)):
    product_id = products.iloc[i]['product_id']
    product_name = products.iloc[i]['product_name']
    query = f"INSERT INTO Products VALUES ('{product_id}', '{product_name}')".\
            format(product_id=product_id, product_name=product_name)
    print("Executing: ", query)
    cursor.execute(query)

# Commit changes
cursor.execute('commit')
# Close cursor
cursor.close()
# Close connection
conn.close()

Executing:  INSERT INTO Products VALUES ('1', 'Coca-Cola')
Executing:  INSERT INTO Products VALUES ('2', 'Doritos Nacho Cheese')
Executing:  INSERT INTO Products VALUES ('3', 'Kit Kat')
Executing:  INSERT INTO Products VALUES ('4', 'Red Bull')
Executing:  INSERT INTO Products VALUES ('5', 'Pringles Original')
Executing:  INSERT INTO Products VALUES ('6', 'Reese\'s Peanut Butter Cups')
Executing:  INSERT INTO Products VALUES ('7', 'M&M\'s Peanut')
Executing:  INSERT INTO Products VALUES ('8', 'Lay\'s Classic')
Executing:  INSERT INTO Products VALUES ('9', 'Snapple Peach Tea')
Executing:  INSERT INTO Products VALUES ('10', 'Tostitos Scoops')

In [26]:
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

# Select query: display all products
table = "Products"
query = f"SELECT * FROM {table}"
cursor.execute(query)
records = [record for record in cursor]
print(query)
print(records)
# Close cursor
cursor.close()
# Close connection
conn.close()

SELECT * FROM Products
[(1, 'Coca-Cola'), (2, 'Doritos Nacho Cheese'), (3, 'Kit Kat'), (8, "Lay's Classic"), (7, "M&M's Peanut"), (5, 'Pringles Original'), (4, 'Red Bull'), (6, "Reese's Peanut Butter Cups"), (9, 'Snapple Peach Tea'), (10, 'Tostitos Scoops')]

In [27]:
# Reading the CSV into a pandas dataframe
prices = pd.read_csv('prices.csv', header=None)
prices.columns = ['product_id', 'price']
prices.head(10)

   product_id  price
0           1   1.99
1           2   2.49
2           3   0.99
3           4   3.29
4           5   1.79
5           6   1.99
6           7   1.29
7           8   1.49
8           9   1.99
9          10   2.99

In [28]:
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

# Inserting prices
for i in range(len(prices)):
    product_id = prices.iloc[i]['product_id']
    price = prices.iloc[i]['price']
    query = f"INSERT INTO Prices VALUES ('{product_id}', '{price}')".\
            format(product_id=product_id, price=price)
    print("Executing: ", query)
    cursor.execute(query)

# Commit changes
cursor.execute('commit')
# Close cursor
cursor.close()
# Close connection
conn.close()

Executing:  INSERT INTO Prices VALUES ('1.0', '1.99')
Executing:  INSERT INTO Prices VALUES ('2.0', '2.49')
Executing:  INSERT INTO Prices VALUES ('3.0', '0.99')
Executing:  INSERT INTO Prices VALUES ('4.0', '3.29')
Executing:  INSERT INTO Prices VALUES ('5.0', '1.79')
Executing:  INSERT INTO Prices VALUES ('6.0', '1.99')
Executing:  INSERT INTO Prices VALUES ('7.0', '1.29')
Executing:  INSERT INTO Prices VALUES ('8.0', '1.49')
Executing:  INSERT INTO Prices VALUES ('9.0', '1.99')
Executing:  INSERT INTO Prices VALUES ('10.0', '2.99')

In [29]:
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

# Select query: display all prices
table = "Prices"
query = f"SELECT * FROM {table}"
cursor.execute(query)
records = [record for record in cursor]
print(query)
print(records)
# Close cursor
cursor.close()
# Close connection
conn.close()

SELECT * FROM Prices
[(1, Decimal('1.99')), (2, Decimal('2.49')), (3, Decimal('0.99')), (4, Decimal('3.29')), (5, Decimal('1.79')), (6, Decimal('1.99')), (7, Decimal('1.29')), (8, Decimal('1.49')), (9, Decimal('1.99')), (10, Decimal('2.99'))]

In [30]:
# Reading the CSV into a pandas dataframe
purchase = pd.read_csv('purchases.csv', header=None)
purchase.columns = ['purchase_id', 'product_id', 'purchase_date', 'quantity']
purchase.head(10)

   purchase_id  product_id purchase_date  quantity
0        25769           1    2022-10-17         1
1        70898           2    2022-09-06         6
2        52159           3    2022-03-13         4
3        19012           4    2022-04-02         8
4        29751           5    2022-07-03         2
5        23409           6    2022-08-25         7
6        17823           7    2022-10-02         6
7        47419           8    2022-09-22         3
8        88036           9    2022-11-07         2
9        49055          10    2022-06-15         9

In [31]:
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

# Inserting purchases
for i in range(len(purchase)):
    purchase_id = purchase.iloc[i]['purchase_id']
    product_id = purchase.iloc[i]['product_id']
    purchase_date = purchase.iloc[i]['purchase_date']
    quantity = purchase.iloc[i]['quantity']
    query = f"INSERT INTO Purchases VALUES ('{purchase_id}', '{product_id}', '{purchase_date}', '{quantity}')".\
            format(purchase_id=purchase_id, product_id=product_id, purchase_date=purchase_date, quantity=quantity)
    print("Executing: ", query)
    cursor.execute(query)

# Commit changes
cursor.execute('commit')
# Close cursor
cursor.close()
# Close connection
conn.close()

Executing:  INSERT INTO Purchases VALUES ('25769', '1', '2022-10-17', '1')
Executing:  INSERT INTO Purchases VALUES ('70898', '2', '2022-09-06', '6')
Executing:  INSERT INTO Purchases VALUES ('52159', '3', '2022-03-13', '4')
Executing:  INSERT INTO Purchases VALUES ('19012', '4', '2022-04-02', '8')
Executing:  INSERT INTO Purchases VALUES ('29751', '5', '2022-07-03', '2')
Executing:  INSERT INTO Purchases VALUES ('23409', '6', '2022-08-25', '7')
Executing:  INSERT INTO Purchases VALUES ('17823', '7', '2022-10-02', '6')
Executing:  INSERT INTO Purchases VALUES ('47419', '8', '2022-09-22', '3')
Executing:  INSERT INTO Purchases VALUES ('88036', '9', '2022-11-07', '2')
Executing:  INSERT INTO Purchases VALUES ('49055', '10', '2022-06-15', '9')

In [32]:
# add a new column for purchases --> total = quantity * price
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

#cursor.execute("ALTER TABLE purchases DROP COLUMN total")

# create the total price column
cursor.execute("ALTER TABLE purchases ADD COLUMN total DECIMAL(10,2)")

# updates total price
cursor.execute("UPDATE purchases SET total = (SELECT price * quantity FROM Prices WHERE Prices.product_id = Purchases.product_id)")

# commit changes
conn.commit()

cursor.close()
conn.close()

In [33]:
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

# Select query: display all purchases
table = "Purchases"
query = f"SELECT * FROM {table}"
cursor.execute(query)
records = [record for record in cursor]
print(query)
print(records)
# Close cursor
cursor.close()
# Close connection
conn.close()

SELECT * FROM Purchases
[(17823, 7, datetime.date(2022, 10, 2), 6, Decimal('7.74')), (19012, 4, datetime.date(2022, 4, 2), 8, Decimal('26.32')), (23409, 6, datetime.date(2022, 8, 25), 7, Decimal('13.93')), (25769, 1, datetime.date(2022, 10, 17), 1, Decimal('1.99')), (29751, 5, datetime.date(2022, 7, 3), 2, Decimal('3.58')), (47419, 8, datetime.date(2022, 9, 22), 3, Decimal('4.47')), (49055, 10, datetime.date(2022, 6, 15), 9, Decimal('26.91')), (52159, 3, datetime.date(2022, 3, 13), 4, Decimal('3.96')), (70898, 2, datetime.date(2022, 9, 6), 6, Decimal('14.94')), (88036, 9, datetime.date(2022, 11, 7), 2, Decimal('3.98'))]

In [34]:
# Query for Products for certain name
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

table = "Products"
attribute = 'product_name'
target = "'Red Bull'"
query = f"SELECT * FROM {table} WHERE {attribute}={target}"
cursor.execute(query)
records = [record for record in cursor]
print(query)
print(records)
# Close cursor
cursor.close()
# Close connection
conn.close()

SELECT * FROM Products WHERE product_name='Red Bull'
[(4, 'Red Bull')]

In [35]:
# Query for Prices for certain price

conn = mysql.connector.connect(**config)
cursor = conn.cursor()

table = "Prices"
attribute = 'price'
target = "1.99"
query = f"SELECT * FROM {table} WHERE {attribute}={target}"
cursor.execute(query)
records = [record for record in cursor]
print(query)
print(records)
# Close cursor
cursor.close()
# Close connection
conn.close()

SELECT * FROM Prices WHERE price=1.99
[(1, Decimal('1.99')), (6, Decimal('1.99')), (9, Decimal('1.99'))]

In [36]:
# Query for Purchases by purchase_date
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

table = "Purchases"
attribute = 'purchase_date'
target = "'2022-08-25'"
query = f"SELECT * FROM {table} WHERE {attribute}={target}"
cursor.execute(query)
records = [record for record in cursor]
print(query)
print(records)
# Close cursor
cursor.close()
# Close connection
conn.close()

SELECT * FROM Purchases WHERE purchase_date='2022-08-25'
[(23409, 6, datetime.date(2022, 8, 25), 7, Decimal('13.93'))]

In [37]:
# Remove record from Products and Prices and Purchases: remove by product_name or product_id, when
# deleting from Products, Prices and Purchases will cascade the changes
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

table = "Products"
attribute = "product_name" # can be product_id
target = "'Kit Kat'"   # can be product_id
query = f"DELETE FROM {table} WHERE {attribute}={target}"
cursor.execute(query)
print(query)

conn.commit()
# Close cursor
cursor.close()
# Close connection
conn.close()

# In this case, Kit Kat with product_id 3 will be removed from all 3 tables

DELETE FROM Products WHERE product_name='Kit Kat'

In [38]:
# Remove record from Purchases: remove by any attributes by changing attribute variable
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

attribute = "purchase_id"   # can change into other attributes
target = "'23409'"  # change according to the attribute
query = f"DELETE FROM Purchases WHERE {attribute}={target}"
print(query)
cursor.execute(query)

conn.commit()
cursor.close()
conn.close()

DELETE FROM Purchases WHERE purchase_id='23409'

In [39]:
# Inserting an item into Products and Prices
conn = mysql.connector.connect(**config)
cursor = conn.cursor()


attribute = "product_name"
target = "'Popcorn'"
price = "2.69"

query = f"INSERT INTO Products ({attribute}) VALUES ({target})"
cursor.execute(query)
print(query)

# Set price to 0.00 as placeholder, prepare to update later
query = f"INSERT INTO Prices (price) VALUES (0.00)"
cursor.execute(query)
print(query)

# Assign product_id for the added item in Prices table
query = f"UPDATE Prices SET product_id=(SELECT product_id FROM Products WHERE product_name={target}) WHERE price='0.00'"
cursor.execute(query)
print(query)

# Update price from 0.00 to the correct price
query = f"UPDATE Prices SET price={price} WHERE price='0.00'"
cursor.execute(query)
print(query)


conn.commit()
# Close cursor
cursor.close()
# Close connection
conn.close()

INSERT INTO Products (product_name) VALUES ('Popcorn')
INSERT INTO Prices (price) VALUES (0.00)
UPDATE Prices SET product_id=(SELECT product_id FROM Products WHERE product_name='Popcorn') WHERE price='0.00'
UPDATE Prices SET price=2.69 WHERE price='0.00'

In [40]:
# Make Purchase, Insert into Purchases
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

item = "'Red Bull'"
quantity = 12
purchase_date = date.today()

query = f"SELECT product_id FROM Products WHERE product_name={item}"
print(query)
cursor.execute(query)
item_id = [record for record in cursor][0][0]

query = f"SELECT price FROM Prices WHERE product_id={item_id}"
print(query)
cursor.execute(query)
item_price = [record for record in cursor][0][0]

query = f"INSERT INTO Purchases (product_id, purchase_date, quantity, total) VALUES ({item_id},'{purchase_date}',{quantity},{item_price*quantity})"
print(query)
cursor.execute(query)

conn.commit()
cursor.close()
conn.close()

SELECT product_id FROM Products WHERE product_name='Red Bull'
SELECT price FROM Prices WHERE product_id=4
INSERT INTO Purchases (product_id, purchase_date, quantity, total) VALUES (4,'2023-05-13',12,39.48)

In [41]:
# Update product_name in Products
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

new_name = "'Pepsi'"
product_id = 1
query = f"UPDATE Products SET product_name={new_name} WHERE product_id={product_id}"
print(query)
cursor.execute(query)

conn.commit()
cursor.close()
conn.close()

UPDATE Products SET product_name='Pepsi' WHERE product_id=1

In [42]:
# Update price in Prices
conn = mysql.connector.connect(**config)
cursor = conn.cursor()

new_price = 128.00
product_id = 7
query = f"UPDATE Prices SET price={new_price} WHERE product_id={product_id}"
print(query)     
cursor.execute(query)

conn.commit()
cursor.close()
conn.close()

UPDATE Prices SET price=128.0 WHERE product_id=7